#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```hcl
terraform
local_file.public_key: Refreshing state... [id=c32e4c96c34aa49e26a3600a3a26504216e76aa1]
local_file.private_key: Refreshing state... [id=d7ee99f300105e6d5f8b19029cf26f7709d6288b]
tls_private_key.boundary: Refreshing state... [id=61baa37ee0462af3b013018748715d00bfb559e8]
local_file.ssh_into_machine: Refreshing state... [id=d017d2fca21b3f3e32e42620876f253314e35882]
aws_key_pair.generated_key: Refreshing state... [id=Boundary EC2 machines access key]
aws_vpc.boundary: Refreshing state... [id=vpc-086792c66bdab81b6]
aws_internet_gateway.boundary: Refreshing state... [id=igw-0015106fd94f602a4]
aws_subnet.boundary[0]: Refreshing state... [id=subnet-02abdae5c4021fddb]
aws_subnet.boundary[1]: Refreshing state... [id=subnet-0caf30b5095a0763d]
aws_default_route_table.boundary: Refreshing state... [id=rtb-092ce5ddfd20e8d0b]
aws_instance.boundary_controller: Refreshing state... [id=i-0adad61bcd26e8001]
aws_route_table_association.boundary[1]: Refreshing state... [id=rtbassoc-0e84edc9c73a3ec3e]
aws_route_table_association.boundary[0]: Refreshing state... [id=rtbassoc-0b8d3968e8bc69b45]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_internet_gateway.boundary has been changed
  ~ resource "aws_internet_gateway" "boundary" {
        id       = "igw-0015106fd94f602a4"
      + tags     = {}
        # (4 unchanged attributes hidden)
    }
  # aws_vpc.boundary has been changed
  ~ resource "aws_vpc" "boundary" {
        id                               = "vpc-086792c66bdab81b6"
      + tags                             = {}
        # (17 unchanged attributes hidden)
    }
  # aws_subnet.boundary[0] has been changed
  ~ resource "aws_subnet" "boundary" {
        id                              = "subnet-02abdae5c4021fddb"
      ~ tags                            = {
          - "creator" = "terraform" -> null
          - "goal"    = "haunted_house" -> null
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)
    }
  # aws_subnet.boundary[1] has been changed
  ~ resource "aws_subnet" "boundary" {
        id                              = "subnet-0caf30b5095a0763d"
      ~ tags                            = {
          - "creator" = "terraform" -> null
          - "goal"    = "haunted_house" -> null
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)
    }
  # aws_key_pair.generated_key has been changed
  ~ resource "aws_key_pair" "generated_key" {
        id          = "Boundary EC2 machines access key"
      ~ tags        = {
          - "creator" = "terraform" -> null
          - "goal"    = "haunted_house" -> null
        }
        # (6 unchanged attributes hidden)
    }
  # aws_default_route_table.boundary has been changed
  ~ resource "aws_default_route_table" "boundary" {
        id                     = "rtb-092ce5ddfd20e8d0b"
      + propagating_vgws       = []
      + tags                   = {}
        # (6 unchanged attributes hidden)
    }
  # local_file.public_key has been deleted
  - resource "local_file" "public_key" {
      - content              = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDkEfPkqcop257ZDpER82Lu5wefeg/9WSHOJVp9NJoq0mlAuGHyqma20vxYMv14Ar3twoQesKecG380UIxjwa15LILELtLuJ2r8aXbkfjBJdMkIpAd2sLI7lwJ1ajPhHvmH6PBL4j+ROCs39fltXuQJJ7i96MOYZncSOaSHWHrBjzZ00p9HlrIE2Zffbe63cMFLz751iD2KmXCalw4b0ccaw8TXf0HHF5QRA7a0+vD1p8gGaL8OP4JCTZBPTv0necJUFjyV3KZUCoxyo5Kuk05U8M7ppsx5/VjhqSKqmF7hIpby5wqdllvfgQDKIh+FkrrpyS9PgyvSGbx+GMcs51ZMTRCF7h3A16n1ypZ1qHRzpdg8nrOhWA6i7+4no9Zvpc90cloUkOiwf7TYA0usbrC2dOOcEnyULJHFTSUPRdStmjHcdK2ZC61TPr9PISZYxxiFnMTxmajy5KVM2LsW+ofj7iKVNPd9Hf9QSxJTnYW1HsvLSPPdm1zKgPxLrWpDJ+EB9UHWgScg8X7jPvBjcgxOdqZch03xledZyD/wCbEjHpkcbPxw1h97dTxGOrtgjyyr+H3TlknJiig2DiT4qYfrxq4lwici8jDXf+mXD9d4TvNdJC4ysu37BOuIb5o7gBSQlK/LTvLj5dKNd1TmzJvxbjn2DfkF5E4sDC27CnVyyQ==
        EOT -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0600" -> null
      - filename             = "../secrets/boundary.rsa.pub" -> null
      - id                   = "c32e4c96c34aa49e26a3600a3a26504216e76aa1" -> null
    }
  # local_file.ssh_into_machine has been deleted
  - resource "local_file" "ssh_into_machine" {
      - content              = "ssh -i secrets/boundary.rsa ubuntu@" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "../ssh_into_machine_and_tail.sh" -> null
      - id                   = "d017d2fca21b3f3e32e42620876f253314e35882" -> null
    }
  # local_file.private_key has been deleted
  - resource "local_file" "private_key" {
      - content              = (sensitive) -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0600" -> null
      - filename             = "../secrets/boundary.rsa" -> null
      - id                   = "d7ee99f300105e6d5f8b19029cf26f7709d6288b" -> null
    }
  # aws_instance.boundary_controller has been changed
  ~ resource "aws_instance" "boundary_controller" {
        id                                   = "i-0adad61bcd26e8001"
      ~ tags                                 = {
          - "creator" = "terraform" -> null
          - "goal"    = "haunted_house" -> null
        }
        # (27 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.skeleton_key will be created
  + resource "aws_acm_certificate" "skeleton_key" {
      + arn                       = (known after apply)
      + domain_name               = "skeleton-key.nl"
      + domain_validation_options = [
          + {
              + domain_name           = "skeleton-key.nl"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags_all                  = {
          + "creator" = "terraform"
          + "goal"    = "haunted_house"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.default will be created
  + resource "aws_acm_certificate_validation" "default" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_alb_target_group_attachment.physical_boundary_controller will be created
  + resource "aws_alb_target_group_attachment" "physical_boundary_controller" {
      + id               = (known after apply)
      + port             = 8080
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # aws_default_route_table.boundary will be updated in-place
  ~ resource "aws_default_route_table" "boundary" {
        id                     = "rtb-092ce5ddfd20e8d0b"
        tags                   = {}
      ~ tags_all               = {
          + "creator" = "terraform"
          + "goal"    = "haunted_house"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_instance.boundary_controller must be replaced
-/+ resource "aws_instance" "boundary_controller" {
      ~ arn                                  = "arn:aws:ec2:eu-west-1:828615884287:instance/i-0adad61bcd26e8001" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "eu-west-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0adad61bcd26e8001" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_addresses                       = [
          - "2a05:d018:1f4:600:ef0b:6496:b08d:9084",
        ] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0670f7a911e4034ff" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-239.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.239" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - tags                                 = {} -> null
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0d04148f2d599f7ea",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-03f5200a6b44c12fb" -> (known after apply)
          ~ volume_size           = 8 -> 50
          ~ volume_type           = "gp2" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_internet_gateway.boundary will be updated in-place
  ~ resource "aws_internet_gateway" "boundary" {
        id       = "igw-0015106fd94f602a4"
        tags     = {}
      ~ tags_all = {
          + "creator" = "terraform"
          + "goal"    = "haunted_house"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_lb.boundary_controller will be created
  + resource "aws_lb" "boundary_controller" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 10
      + internal                   = false
      + ip_address_type            = "dualstack"
      + load_balancer_type         = "application"
      + name                       = "boundary-controller"
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-02abdae5c4021fddb",
          + "subnet-0caf30b5095a0763d",
        ]
      + tags_all                   = {
          + "creator" = "terraform"
          + "goal"    = "haunted_house"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.boundary_controller will be created
  + resource "aws_lb_listener" "boundary_controller" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = {
          + "creator" = "terraform"
          + "goal"    = "haunted_house"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Boundary Controller Listener"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.boundary_controller will be created
  + resource "aws_lb_listener_rule" "boundary_controller" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags_all     = {
          + "creator" = "terraform"
          + "goal"    = "haunted_house"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/serve/*",
                ]
            }
        }
    }

  # aws_lb_target_group.boundary_controller will be created
  + resource "aws_lb_target_group" "boundary_controller" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "boundary-controller"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTPS"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "creator" = "terraform"
          + "goal"    = "haunted_house"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-086792c66bdab81b6"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_route53_record.boundary will be created
  + resource "aws_route53_record" "boundary" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "boundary.skeleton-key.nl"
      + type            = "A"
      + zone_id         = "Z05539892P90UPSCLLLL5"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.validation will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05539892P90UPSCLLLL5"
    }

  # aws_security_group.boundary-ssh will be created
  + resource "aws_security_group" "boundary-ssh" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Outbound all allowed"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Inbound SSH allowed"
              + from_port        = 22
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Inbound TLS allowed"
              + from_port        = 443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "boundary-ssh-access"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "creator" = "terraform"
          + "goal"    = "haunted_house"
        }
      + vpc_id                 = "vpc-086792c66bdab81b6"
    }

  # aws_subnet.boundary[0] will be updated in-place
  ~ resource "aws_subnet" "boundary" {
        id                              = "subnet-02abdae5c4021fddb"
      ~ map_public_ip_on_launch         = false -> true
      ~ tags                            = {
          - "Name" = "subnet1" -> null
        }
      ~ tags_all                        = {
          - "Name"    = "subnet1" -> null
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_subnet.boundary[1] will be updated in-place
  ~ resource "aws_subnet" "boundary" {
        id                              = "subnet-0caf30b5095a0763d"
      ~ map_public_ip_on_launch         = false -> true
      ~ tags                            = {
          - "Name" = "subnet2" -> null
        }
      ~ tags_all                        = {
          - "Name"    = "subnet2" -> null
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_vpc.boundary will be updated in-place
  ~ resource "aws_vpc" "boundary" {
        id                               = "vpc-086792c66bdab81b6"
        tags                             = {}
      ~ tags_all                         = {
          + "creator" = "terraform"
          + "goal"    = "haunted_house"
        }
        # (16 unchanged attributes hidden)
    }

  # null_resource.run_boundary_fake will be created
  + resource "null_resource" "run_boundary_fake" {
      + id       = (known after apply)
      + triggers = {
          + "boundary_script" = "c6f051ff21ad844692d690cc1b4aeb68"
          + "config"          = "d41d8cd98f00b204e9800998ecf8427e"
          + "general_script"  = "b1c32c7eb7507456eca2798e67760634"
        }
    }

Plan: 12 to add, 5 to change, 1 to destroy.

Changes to Outputs:
  + boundary_ip   = (known after apply)
  ~ boundary_ipv6 = [
      - "2a05:d018:1f4:600:ef0b:6496:b08d:9084",
    ] -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

**Pusher**: @jdekoning
**Action**: pull_request
